src/cf/InformationRegisters/СтавкиНДСПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтавкиНДСПоДоговорам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособЗаполненияСтавкиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СтавкиНДСПоДоговорам/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтотОбъект[0].Организация) И ЗначениеЗаполнено(ЭтотОбъект[0].ДоговорКонтрагента) Тогда
		ЭтотОбъект[0].Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект[0].ДоговорКонтрагента,
			"Организация");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтотОбъект[0].Контрагент) И ЗначениеЗаполнено(ЭтотОбъект[0].ДоговорКонтрагента) Тогда
		ЭтотОбъект[0].Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект[0].ДоговорКонтрагента,
			"Владелец");
		;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
